package day5;

public class Task1 {
    /*
    Создать класс Автомобиль (англ. Car) с полями “Год выпуска”, “Цвет”, “Модель”. Создать get и set методы
    для каждого поля. Создать экземпляр класса Автомобиль. Задать значение для каждого поля, используя set методы.
    Вывести в консоль значение каждого из полей, используя get методы.
    Созданный вами класс должен отвечать принципам инкапсуляции.
     */
//    public static void main(String[] args) {
//        Car car = new Car();
//        car.setYear(1980);
//        car.setColor("Black");
//        car.setModel("BMW");
//        System.out.println("Год выпуска: " + car.getYear() + " Цвет: " + car.getColor() + " Модель: " + car.getModel());
//    }
}

